{
  "timing_stability": {
    "low":  {"clip_uri": "", "desc": "Noticeable pulse jitter at the beat level; uneven spacing across bars."},
    "mid":  {"clip_uri": "", "desc": "Mostly steady pulse with minor fluctuations; generally locked to the beat."},
    "high": {"clip_uri": "", "desc": "Consistently steady pulse across bars; metronomic without rigidity."}
  },
  "tempo_control": {
    "low":  {"clip_uri": "", "desc": "Tempo drifts or rushes significantly; inconsistent with musical phrase structure."},
    "mid":  {"clip_uri": "", "desc": "Generally stable tempo with musical rubato; occasional unintentional fluctuation."},
    "high": {"clip_uri": "", "desc": "Purposeful tempo choices that serve the music; stable when needed, expressive when appropriate."}
  },
  "rhythmic_accuracy": {
    "low":  {"clip_uri": "", "desc": "Frequent rhythmic errors; note values don't match score subdivisions."},
    "mid":  {"clip_uri": "", "desc": "Generally accurate rhythms with occasional imprecision in complex passages."},
    "high": {"clip_uri": "", "desc": "Precise rhythmic execution; clear subdivision and groove across all passages."}
  },
  "articulation_length": {
    "low":  {"clip_uri": "", "desc": "Notes are overly detached or overly overlapped vs. score intent; inconsistent lengths."},
    "mid":  {"clip_uri": "", "desc": "Generally appropriate note lengths with occasional mismatch to score phrasing."},
    "high": {"clip_uri": "", "desc": "Realized durations match score intent closely; crisp legato/staccato where appropriate."}
  },
  "articulation_hardness": {
    "low":  {"clip_uri": "", "desc": "Attacks are too soft or harsh for the musical context; lacks dynamic variety."},
    "mid":  {"clip_uri": "", "desc": "Generally appropriate attack character with some inconsistency."},
    "high": {"clip_uri": "", "desc": "Attack intensity perfectly matched to musical content; varied and expressive."}
  },
  "pedal_density": {
    "low":  {"clip_uri": "", "desc": "Too little pedal use; dry sound lacks warmth and connection."},
    "mid":  {"clip_uri": "", "desc": "Moderate pedal use; generally appropriate but could be more sophisticated."},
    "high": {"clip_uri": "", "desc": "Rich, varied pedal technique; sophisticated use of half-pedal and timing."}
  },
  "pedal_clarity": {
    "low":  {"clip_uri": "", "desc": "Blurred harmony; excessive sustain obscures inner voices and bass clarity."},
    "mid":  {"clip_uri": "", "desc": "Pedal mostly supportive; occasional blur on fast harmonic changes."},
    "high": {"clip_uri": "", "desc": "Clean harmonic transitions; sympathetic resonance controlled; voices remain distinct."}
  },
  "dynamic_range": {
    "low":  {"clip_uri": "", "desc": "Narrow loudness span; little contrast between soft and loud passages."},
    "mid":  {"clip_uri": "", "desc": "Moderate contrast; dynamic shaping is present but could be broader."},
    "high": {"clip_uri": "", "desc": "Wide expressive span from true piano to forte; controlled crescendi/decrescendi."}
  },
  "dynamic_control": {
    "low":  {"clip_uri": "", "desc": "Dynamics are abrupt or uncontrolled; poor voice balance within hands."},
    "mid":  {"clip_uri": "", "desc": "Generally smooth dynamic transitions; occasional imbalance between voices."},
    "high": {"clip_uri": "", "desc": "Sophisticated dynamic control; smooth gradations and perfect voice balance."}
  },
  "balance_melody_vs_accomp": {
    "low":  {"clip_uri": "", "desc": "Melody buried in accompaniment or accompaniment too prominent; poor voice hierarchy."},
    "mid":  {"clip_uri": "", "desc": "Generally clear melody line with occasional balance issues in complex textures."},
    "high": {"clip_uri": "", "desc": "Perfect voice hierarchy; melody always audible, accompaniment supportive and proportional."}
  },
  "phrasing_continuity": {
    "low":  {"clip_uri": "", "desc": "Phrase breaks feel abrupt; breath-line is unclear or chopped."},
    "mid":  {"clip_uri": "", "desc": "Mostly continuous phrasing with occasional awkward break points."},
    "high": {"clip_uri": "", "desc": "Clear long-line; phrase connections are natural and cohesive throughout."}
  },
  "expressiveness_intensity": {
    "low":  {"clip_uri": "", "desc": "Emotionally flat or overly restrained; lacks personal musical voice."},
    "mid":  {"clip_uri": "", "desc": "Some expressive elements present; musical intent is generally clear."},
    "high": {"clip_uri": "", "desc": "Deeply expressive and personally engaged; communicates musical meaning powerfully."}
  },
  "energy_level": {
    "low":  {"clip_uri": "", "desc": "Lethargic or under-energized for the musical context; lacks vitality."},
    "mid":  {"clip_uri": "", "desc": "Appropriate energy level for most passages; occasional mismatch to character."},
    "high": {"clip_uri": "", "desc": "Energy perfectly matched to musical character; vibrant and alive throughout."}
  },
  "timbre_brightness": {
    "low":  {"clip_uri": "", "desc": "Dull, muffled tone lacking upper harmonics; sounds covered or muddy."},
    "mid":  {"clip_uri": "", "desc": "Balanced tone with adequate brightness; generally pleasant timbre."},
    "high": {"clip_uri": "", "desc": "Brilliant, clear tone with rich upper harmonics; sparkling and vibrant sound."}
  },
  "timbre_richness": {
    "low":  {"clip_uri": "", "desc": "Thin, monochromatic sound lacking harmonic complexity."},
    "mid":  {"clip_uri": "", "desc": "Generally full sound with moderate harmonic content."},
    "high": {"clip_uri": "", "desc": "Rich, complex timbre with full harmonic spectrum; resonant and warm."}
  },
  "timbre_color_variety": {
    "low":  {"clip_uri": "", "desc": "Monotonous tonal palette; lacks variety in sound colors across the piece."},
    "mid":  {"clip_uri": "", "desc": "Some timbral variation; generally appropriate to different musical sections."},
    "high": {"clip_uri": "", "desc": "Wide palette of sound colors; masterful variety matched to musical content."}
  }
}
