{"moment_id":"d70c4740-ad80-4242-b837-67ae9da04e29","video_id":"7geAMvhsLzY","video_title":"Piano lesson by Graham Fitch: Understanding the markings on a score, Part 2","teacher":"Unknown","stop_timestamp":168.224,"feedback_start":168.224,"feedback_end":270.944,"playing_before_start":160.992,"playing_before_end":168.224,"transcript_text":"[Before stop] it's got, if I played this literally according to those textbooks, we've got dotted rhythms there. So therefore divisions of four. One, two, three, four, one, two, three, four, one, two, three, four, one, two, three, four, one. But I don't think I've heard I've ever heard anybody do it literally like that because the tradition is to over dot in this kind of French style piece. So I would play much sharper. [Teacher feedback] Now, that's an interesting moment because Bach has officially written that as a semiquaver, that left hand C. But a lot of players double dot that they assimilate that rhythm in the tenor voice with what's been going on in the tenor voice. And that's fine. So you notice there, I wasn't quite sure what my subdivisions were in that instance. Let's say I do a division of six. I don't know that I can count up to six as fast as I'm going to need to but I'll try. One, two, three, four, five, six, one, two, three, four, five, six, one. One, two, three, four, five, six, one, two, three, four, five, six, one. Now, I know I'm not going to be able to count up to eight. But the fastest or the sharpest version of this I've heard, the pianist got up to nine. So one, two, three, four, five, six, seven, eight, nine, one, two, three, four, five, six, seven, eight, nine, one. And the way I found that out was by slowing down the recording. If you watch on YouTube, you can go to the settings wheel and where it says speed, playback speed, you can make it half as slow or a quarter as slow. Now, you don't hear the music. The quality of the tone is pretty bad, but you can hear things. Things like that. So you can use it for research. So that would be a good example of double dotting. Now, the Haydn variations in F minor, this beautiful piece, there's a kind of funereal quality to it.","feedback_summary":"The teacher is demonstrating and explaining the concept of 'double dotting' in music notation.","musical_dimension":"interpretation","secondary_dimensions":["technique"],"severity":"minor","feedback_type":"demonstration","piece":null,"composer":"Bach/Haydn (implied)","passage_description":"left hand C; dotted rhythms in French style piece, Haydn variations","student_level":"intermediate/advanced (based on transcription setting)","stop_order":1,"total_stops":8,"time_spent_seconds":102.72000000000004,"demonstrated":true,"extracted_at":"2026-02-11T06:31:24.303264+00:00","extraction_model":"llama3.1","confidence":0.9}
{"moment_id":"0a436fe0-bfad-42a3-9604-3112f7b71656","video_id":"7geAMvhsLzY","video_title":"Piano lesson by Graham Fitch: Understanding the markings on a score, Part 2","teacher":"Unknown","stop_timestamp":287.424,"feedback_start":287.424,"feedback_end":314.112,"playing_before_start":270.944,"playing_before_end":287.424,"transcript_text":"[Before stop] And the way I found that out was by slowing down the recording. If you watch on YouTube, you can go to the settings wheel and where it says speed, playback speed, you can make it half as slow or a quarter as slow. Now, you don't hear the music. The quality of the tone is pretty bad, but you can hear things. Things like that. So you can use it for research. So that would be a good example of double dotting. Now, the Haydn variations in F minor, this beautiful piece, there's a kind of funereal quality to it. [Teacher feedback] Now, the left hand has it. That's got to be really. Is it? Am I doing divisions of one, two, three, four, one? What I'm actually doing is I'm not really double dotting it, but I'm elongating the dotted note just a tiny little bit, rhythmically speaking. And I'm doing a division of five just to sharpen it up a little bit. One, two, three, four, five, one.","feedback_summary":"Student was elongating dotted notes and dividing eighth notes for rhythmic emphasis.","musical_dimension":"timing","secondary_dimensions":["dynamics","technique"],"severity":"minor","feedback_type":"correction","piece":null,"composer":null,"passage_description":"Haydn variations in F minor","student_level":"intermediate","stop_order":2,"total_stops":8,"time_spent_seconds":26.688000000000045,"demonstrated":false,"extracted_at":"2026-02-11T06:31:40.183796+00:00","extraction_model":"llama3.1","confidence":1.0}
{"moment_id":"732fb970-411e-4c1b-a966-512714934aaf","video_id":"7geAMvhsLzY","video_title":"Piano lesson by Graham Fitch: Understanding the markings on a score, Part 2","teacher":"Unknown","stop_timestamp":407.072,"feedback_start":407.072,"feedback_end":463.552,"playing_before_start":402.688,"playing_before_end":407.072,"transcript_text":"[Before stop] One, two, three, four. one and a two right and in the left hand he's written dotted rhythms what looked like dotted rhythms they're not he didn't have a way of writing one two three one two three one two three one so there's an example of under dotting or rhythmical assimilation where we play the semiquaver the 16th note together with the third triplet i'll do it very slowly you can hear it [Teacher feedback] do you hear how those fit together and that is the correct the only correct way of realizing it if you look up the score and try and play it as it looks like if you're looking at it through 20th century or 21st century eyes you'd be absolutely incorrect to dot that in the way that it looks they're triplets in the left hand there's an example here from the pathetique sonata of beethoven the slow movement and if you want to know exactly which bar i'm looking at bar 55 but let me put it a little bit in the context we've got now triplet subdivisions now hit this spot","feedback_summary":"The teacher explains that dotted rhythms in the score should be realized as triplets, and shows an example from Beethoven's Pathetique sonata.","musical_dimension":"timing","secondary_dimensions":["interpretation"],"severity":"moderate","feedback_type":"explanation","piece":null,"composer":"Beethoven","passage_description":"Pathetique sonata, slow movement, bar 55","student_level":null,"stop_order":3,"total_stops":8,"time_spent_seconds":56.48000000000002,"demonstrated":true,"extracted_at":"2026-02-11T06:31:58.533361+00:00","extraction_model":"llama3.1","confidence":1.0}
{"moment_id":"63b2f2f0-84d3-49ab-8693-0557c7c19e7c","video_id":"7geAMvhsLzY","video_title":"Piano lesson by Graham Fitch: Understanding the markings on a score, Part 2","teacher":"Unknown","stop_timestamp":466.432,"feedback_start":466.432,"feedback_end":517.184,"playing_before_start":463.552,"playing_before_end":466.432,"transcript_text":"[Before stop] you'd be absolutely incorrect to dot that in the way that it looks they're triplets in the left hand there's an example here from the pathetique sonata of beethoven the slow movement and if you want to know exactly which bar i'm looking at bar 55 but let me put it a little bit in the context we've got now triplet subdivisions now hit this spot [Teacher feedback] now most people or many people anyway assimilate those two fast notes at the end to that so that they come together with the triplet but if you look at it strictly it looks like it would be it should be this division of four and i don't think that's what beethoven meant because this tradition of rhythmic assimilation was very much alive even beyond beethoven we'll find this in schubert as well the b flat impromptu sorry i forgot the word for a minute there's a spot there the minor variation variation three play a little bit","feedback_summary":"The teacher stops the student to correct subdividing triplets in the left hand, suggesting it should be in 4 instead of assimilating the two fast notes.","musical_dimension":"articulation","secondary_dimensions":["timing","interpretation"],"severity":"moderate","feedback_type":"correction","piece":"Beethoven's Pathetique Sonata (slow movement)","composer":"Beethoven","passage_description":"bar 55, triplet subdivision in the left hand","student_level":null,"stop_order":4,"total_stops":8,"time_spent_seconds":50.75199999999995,"demonstrated":false,"extracted_at":"2026-02-11T06:32:17.823495+00:00","extraction_model":"llama3.1","confidence":0.8}
{"moment_id":"d3b92519-cf50-44ef-81ee-5497b36f638c","video_id":"7geAMvhsLzY","video_title":"Piano lesson by Graham Fitch: Understanding the markings on a score, Part 2","teacher":"Unknown","stop_timestamp":525.568,"feedback_start":525.568,"feedback_end":760.224,"playing_before_start":517.184,"playing_before_end":525.568,"transcript_text":"[Before stop] division of four and i don't think that's what beethoven meant because this tradition of rhythmic assimilation was very much alive even beyond beethoven we'll find this in schubert as well the b flat impromptu sorry i forgot the word for a minute there's a spot there the minor variation variation three play a little bit [Teacher feedback] this spot in the second bar is written to look like that it's written as a dotted quaver a dotted eighth followed by a semi-quaver 16th so it could be played in that way some people do play it that way they do this by the way that is correct it sounds like i'm playing a wrong note in the left hand and there's a flat note in the right hand so it's a flat note in the left hand and there's a false relation there an e natural against an e flat i'm playing it a bit slower we've got that as one option or we've got this as long as we're consistent with that it really doesn't matter which one we do it's six of one half a dozen of the other we we find it in chopin as well and where he writes a dotted rhythm in the top part and a triplet underneath and nowadays we know enough about performance practice to understand that he is probably intended for those notes to be assimilated in the same way now let's have a little look at rests because that's another thing another sign that gets people agitated do we do them literally in other words do we make literal silences or are we allowed to pedal through them it depends it totally depends here i've got the d minor fantasy of mozart which starts off bathed in pedal you don't need to change the pedal there same harmony of course here you change you can if you want change each bar if you find that the sound is getting a bit thick change is fine but the spot i'm interested in is the end of the bar and the end of the bar is the end of the bar and so there's a lot of this kind of play around with that opening section where mozart writes um a decorated chord dominant chord a decorated a major chord now i don't know how that grabs you is that too resonant it may very well be a little bit too resonant but certainly on a period piano you would absolutely they would they would do that if you'd go to a piano and play it with a piano like this and then you'd play it with a piano like this and then you'd play it with a piano like this and then you'd play it with a piano like this and then you'd play it with a piano like this and then you'd play it with a piano like this and then you'd play it with a piano like this with with one long pedal even though i'm covering over plenty of rests in the left hand the left hand is written off and if i do it literally with no pedal you'll hear but that sounds so wrong doesn't it not to have pedal so for on our modern instrument we've got a couple of options we could hold the pedal down through these rests and then gradually lift it which is the solution favored by a lot of pianists or this is another a trick um conjuring trick if you will what i'm going to do is vibrate my pedal i'll tell you when now i'm starting to vibrate so i'm gradually thinning out the sound and removing some of those dissonances now when i go on with the adagio we absolutely want to hear these rests in the right hand because these rests are like breathing places they're like sobs and sighs here here so we don't we mustn't hold the pedal down up","feedback_summary":"This spot in the score can be played as written, or with the dotted rhythm assimilated into triplets; pedaling through rests is a matter of artistic interpretation.","musical_dimension":"interpretation","secondary_dimensions":["technique","dynamics"],"severity":"minor","feedback_type":"explanation","piece":null,"composer":"unknown","passage_description":null,"student_level":null,"stop_order":5,"total_stops":8,"time_spent_seconds":234.6560000000001,"demonstrated":false,"extracted_at":"2026-02-11T06:32:41.550618+00:00","extraction_model":"llama3.1","confidence":0.8}
{"moment_id":"03f7b05b-bd42-4a50-ba61-11030c484f9a","video_id":"7geAMvhsLzY","video_title":"Piano lesson by Graham Fitch: Understanding the markings on a score, Part 2","teacher":"Unknown","stop_timestamp":763.968,"feedback_start":763.968,"feedback_end":907.712,"playing_before_start":760.224,"playing_before_end":763.968,"transcript_text":"[Before stop] so i'm gradually thinning out the sound and removing some of those dissonances now when i go on with the adagio we absolutely want to hear these rests in the right hand because these rests are like breathing places they're like sobs and sighs here here so we don't we mustn't hold the pedal down up [Teacher feedback] so we're going to play a little bit of a slow so we're going to play a little bit of a slow so we're going to play a little bit of a slow so we're going to play a little bit of a slow so we're going to play a little bit of a slow so we're going to play a little bit of a slow so we're going to play a little bit of a slow so we're going to play a little bit of a slow so we're going to play a little bit of a slow a little bit like sobbing again a little bit like sobbing again a little bit like sobbing again so you go and make a meal of them maybe even play them a little bit broader play them a bit slower certainly not this don't for goodness sake do this do this that changes the tone of the music into something well actually would be very silly wouldn't it in the context these rests absolutely these rests absolutely can you hear the music panting there there now this bar we could if we wanted to package that up in a pedal it's a dominant harmony again even though we've got rests in the left hand we don't have to obey them literally do you see how confusing this is because it does depend even within the same piece it might depend on context so a little bit later in the piece we get this idea get this idea get this idea get this idea very important that we hear the rests because again they're short breathing points ti ta da ti ta da and I want to hear the staccato and I've got a slur afterwards we need to hear that very clearly afterwards we need to hear that very clearly clearly now the left hand is written just in quavers but remember the rule in this period of music that we're in a non legato general kind of default setting so if I have a bunch of quavers like that that don't have a marking on them chances are they could be detached not staccato not that but just slightly detached so I avoid my pedal here","feedback_summary":"The teacher emphasizes the importance of interpreting rests as breathing places and playing them clearly, without holding the sustain pedal.","musical_dimension":"phrasing","secondary_dimensions":["interpretation","pedaling"],"severity":"moderate","feedback_type":"explanation","piece":null,"composer":null,"passage_description":null,"student_level":null,"stop_order":6,"total_stops":8,"time_spent_seconds":143.74400000000003,"demonstrated":true,"extracted_at":"2026-02-11T06:33:00.517326+00:00","extraction_model":"llama3.1","confidence":0.9}
{"moment_id":"8f596803-2cff-43e3-ad6b-f1f8ea38f4f2","video_id":"7geAMvhsLzY","video_title":"Piano lesson by Graham Fitch: Understanding the markings on a score, Part 2","teacher":"Unknown","stop_timestamp":913.728,"feedback_start":913.728,"feedback_end":971.712,"playing_before_start":907.712,"playing_before_end":913.728,"transcript_text":"[Before stop] clearly now the left hand is written just in quavers but remember the rule in this period of music that we're in a non legato general kind of default setting so if I have a bunch of quavers like that that don't have a marking on them chances are they could be detached not staccato not that but just slightly detached so I avoid my pedal here [Teacher feedback] and that is the and that is the D minor fantasy now Grieg Nocturne let me move to the middle section of the Grieg Nocturne now we happen to have a pedal mark here that lasts for two whole bars but Grieg has written in the left hand we're in 6/8 he's written four semiquavers and a quaver rest now that rest cannot mean silence because the pedal's down change pedal here change pedal here see how that works all he's doing by writing the rest there he's telling us don't play anything on that beat in the left hand he's not saying make a literal silence just don't play anything on that beat","feedback_summary":"The teacher reminded the student to avoid using the sustain pedal and instead use slight detaching of notes in quaver passages, and also explained how to interpret rests with the pedal down, which indicates not literal silence but rather no note on that beat.","musical_dimension":"articulation","secondary_dimensions":["pedaling","timing"],"severity":"moderate","feedback_type":"explanation","piece":null,"composer":null,"passage_description":null,"student_level":null,"stop_order":7,"total_stops":8,"time_spent_seconds":57.98400000000004,"demonstrated":false,"extracted_at":"2026-02-11T06:33:19.420361+00:00","extraction_model":"llama3.1","confidence":1.0}
{"moment_id":"b4fa3e1c-c723-4c9a-8aa7-e84744defc67","video_id":"7geAMvhsLzY","video_title":"Piano lesson by Graham Fitch: Understanding the markings on a score, Part 2","teacher":"Unknown","stop_timestamp":973.728,"feedback_start":973.728,"feedback_end":1311.456,"playing_before_start":971.712,"playing_before_end":973.728,"transcript_text":"[Before stop] cannot mean silence because the pedal's down change pedal here change pedal here see how that works all he's doing by writing the rest there he's telling us don't play anything on that beat in the left hand he's not saying make a literal silence just don't play anything on that beat [Teacher feedback] and you may say well why didn't he just write a long note maybe a semiquaver tied to a quaver well if he'd done that we would have put a stress on that G# G# it would have implied length and he doesn't want that he wants us to phrase off can you hear the shaping there so it's from strong to weak implied by the slur even though it's PP so that's an example where we absolutely must pedal through the rests it would be ludicrous not to I'm just going to finish with the Hommage à Rameau by Debussy just to show you how sometimes complex and confusing composers markings are well it starts off fairly straightforward he's just said slow and grave somberly seriously I guess in the style of a Sarabande but without rigor pianissimo expressive and gently sustained not too difficult to understand what he's meaning here now there he writes a double dot probably to say we've had triplet before make sure that doesn't sound like a triplet if he'd written a single dot it could be that some players would make it sound a little bit stodgy so he's saying really sharp that dotted rhythm please guys end of phrase so I'm going to again round off my phrase by playing this softer new phrase starting soft now I've got a hairpin open hairpin which does not mean take time it means get louder high point of the phrase now get softer phrase off again but without taking time French composers tell us when they want us to take time they don't tell us slow down or you know say day or something like that don't take time generally unless he said rubato in which case we would probably so next bar this is very interesting because we've got a long G sharp G sharp G sharp G sharp G sharp down in the lower register of the instrument that is written to last for the whole bar. He's marked it pianissimo but he's put a tenuto on that which means hold it. And above that, piano, this is hard, in one pedal it has to be. The next bar, now I'm going to talk about what I'm doing with my pedal in a moment. But the markings on the upper voice are staccato and then a slur again and then a tenuto. What a control freak. He's telling us how to play everything. In the left hand, these crotchets here are marked staccato under a slur. So he's saying play them short but not too short. Now if you find that that's getting a little bit muddy, what you can do is to adjust the pedal as we go along. I'll show you how that works. I'm going to play this bass note G sharp and I'm going to put a horrendous dissonance with it. I'm going to play a G up here and I'm going to, by slight of foot, get rid of this G but keep the G sharp. You ready? Do you hear what I've done? See, I've managed to retain the bass G sharp but I've lost the dissonance above. So if I do a little bit of adjustment, maybe here, I'm fluttering my pedal. I go down and check the G sharp. Yeah, there's still enough of it left. And I've got rid of the worst of the offence, if there was any offence in the dissonance there. So do you see? We have to look at these markings. And we have to figure out what's going on. We have to figure out what Debussy means. He can't mean a literal staccato with short notes, silence, notes, silence. He's describing a touch. And one thing we can take away from this is that touch shows up through the pedal. So if I play a staccato sequence of notes in the pedal, it will still sound staccato. If you imagine going into a large building, a cathedral or a church or something, and you play a note staccato, the note will ring afterwards because the building is a little bit like the pedal. It carries the note on. But we still hear it as a short note, just with resonance surrounding it. So those are a few signs and symbols that we find in music that are not designed to confuse us. Although they are a little confusing, we do have to consider them. We've got usually more than one option for some of these signs and symbols. And there is wiggle room for interpretation. One person may read it. This way. Another player would read it slightly differently. So I hope that's been of interest and I will look forward to seeing you again soon.","feedback_summary":"Discussion on pedaling and interpreting musical markings in Debussy's Hommage à Rameau, focusing on the role of touch and pedals.","musical_dimension":"technique","secondary_dimensions":["pedaling","tone_color"],"severity":"moderate","feedback_type":"explanation","piece":null,"composer":null,"passage_description":null,"student_level":null,"stop_order":8,"total_stops":8,"time_spent_seconds":337.72799999999995,"demonstrated":false,"extracted_at":"2026-02-11T06:33:45.445870+00:00","extraction_model":"llama3.1","confidence":0.8}
